src/cf/Documents/ВходящееСообщение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВходящееСообщение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/НастройкиПодключенияRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияRabbitMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КоннекторRMQ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОтправитьСообщениеВОчередь(ИсходящееСообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиПодключенияRMQ = Справочники.НастройкиПодключенияRabbitMQ.ПараметрыНастроекПоУмолчанию();
	
	URL = СтрШаблон("http://%1/api/exchanges/%2/%3/publish",
		НастройкиПодключенияRMQ.АдресСервера,
		НастройкиПодключенияRMQ.Хост,
		ИсходящееСообщение.Обменник
	);
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияBasic(НастройкиПодключенияRMQ.ИмяПользователя, НастройкиПодключенияRMQ.Пароль);
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Аутентификация = Аутентификация;
	
	Ответ = КоннекторHTTP.Post(URL, ИсходящееСообщение.Тело, ДополнительныеПараметры);
	
	Результат = Новый Структура;
	Результат.Вставить("Отправлено", Ответ.КодСостояния = 200);
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьСообщенияИзОчереди() Экспорт
	
	НастройкиПодключенияRMQ = Справочники.НастройкиПодключенияRabbitMQ.ПараметрыНастроекПоУмолчанию();
	
	URL = СтрШаблон("http://%1/api/queues/%2/%3/get",
		НастройкиПодключенияRMQ.АдресСервера,
		НастройкиПодключенияRMQ.Хост,
		НастройкиПодключенияRMQ.Очередь
	);
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияBasic(НастройкиПодключенияRMQ.ИмяПользователя, НастройкиПодключенияRMQ.Пароль);
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Аутентификация = Аутентификация;
	
	ТелоЗапроса = "{
	|""count"": 10,
	|""ackmode"": ""ack_requeue_false"",
	|""encoding"": ""auto""
	|}";
	
	Ответ = КоннекторHTTP.Post(URL, ТелоЗапроса, ДополнительныеПараметры);
	
	Сообщения = КоннекторHTTP.КакJson(Ответ, Новый Структура("ПрочитатьВСоответствие", Ложь));
	
	Для Каждого Сообщение Из Сообщения Цикл
		ВходящееСообщение = Документы.ВходящееСообщение.СоздатьВходящееСообщение(Сообщение["payload"], Сообщение["exchange"]);
		РаботаССообщениямиRMQ.ОбработатьВходящееСообщение(ВходящееСообщение);
	КонецЦикла;
	
КонецФункции

#КонецОбласти
